Revit 2027 API
RevitLinkGraphicsSettings.LinkedViewId Property
 The id of the linked view associated with this RevitLinkGraphicsSettings, or InvalidElementId if no view is selected. If the LinkVisibilityType is set to ByLinkView, then there must be a valid LinkedViewId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinkedViewId { get; set; }
Public Property LinkedViewId As ElementId
	Get
	Set
public:
property ElementId^ LinkedViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LinkedViewId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace